In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [5]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [13]:
#df.astype({'FlightNumber':'int32'})

In [26]:
index=list(df['FlightNumber'].index[df['FlightNumber'].apply(np.isnan)])

In [28]:
index

[1, 3]

In [29]:
ser2=df['FlightNumber']

In [33]:
for i in index:
    df['FlightNumber'][i]=int(df['FlightNumber'][i-1])+10

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [34]:
#alternative to above thing is fillna(method='ffill')
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [37]:
df.astype({'FlightNumber':'int'})

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [38]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [41]:
df1=pd.DataFrame()
df1[['From','to']] = df.From_To.str.split('_',expand=True,)

In [51]:
df1['From']=df1['From'].apply(lambda x:x.capitalize())
df1['to']=df1['to'].apply(lambda x:x.capitalize())

In [52]:
df1

       From         to
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [53]:
df[['From','to']]=df1[['From','to']]

In [54]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,to
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [56]:
df.drop('From_To',axis=1,inplace=True)

In [57]:
df

   FlightNumber  RecentDelays              Airline      From         to
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [62]:
df.rename({'to':'To'},axis=1,inplace=True)

In [63]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [82]:
df=df.join(
pd.DataFrame(df.RecentDelays.tolist(), index= df.index))

In [83]:
d=dict()
for i in range(0,df['RecentDelays'].apply(lambda x:len(x)).max()):
                d[i]='Delays_'+str(i+1)

In [84]:
d

{0: 'Delays_1', 1: 'Delays_2', 2: 'Delays_3'}

In [86]:
df.rename(d,axis=1,inplace=True)

In [87]:
df

,FlightNumber,RecentDelays,Airline,From,To,Delays_1,Delays_2,Delays_3
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [88]:
df.fillna(0)

,FlightNumber,RecentDelays,Airline,From,To,Delays_1,Delays_2,Delays_3
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,0.0
1,10055.0,[],<Air France> (12),Madrid,Milan,0.0,0.0,0.0
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,0.0,0.0
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,0.0

In [90]:
df.drop('RecentDelays',axis=1,inplace=True)

In [91]:
df

,FlightNumber,Airline,From,To,Delays_1,Delays_2,Delays_3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN